Revit 2027 API
BalusterPattern.PatternAngle Property
 The angle between neighboring railing segments which conditions breaking patterns distribution along a railing path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double PatternAngle { get; set; }
Public Property PatternAngle As Double
	Get
	Set
public:
property double PatternAngle {
	double get ();
	void set (double value);
}
member PatternAngle : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for patternAngle is not finite
See Also
Reference
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace